In [14]:
# Crosstab: also known as contengency table, 
# displays the frequency of distribution of varibles

import pandas as pd
ds = pd.read_excel("survey.xls")
ds.head()

     Name Nationality     Sex  Age Handedness
0   Kathy         USA  Female   23      Right
1   Linda         USA  Female   18      Right
2   Peter         USA    Male   19      Right
3    John         USA    Male   22       Left
4  Fatima   Bangadesh  Female   31       Left

In [15]:
# making the contengency table
pd.crosstab(ds.Nationality, ds.Handedness)

Handedness   Left  Right
Nationality
Bangadesh       2      0
China           2      1
India           2      1
USA             1      3

In [16]:
# contengency table for sex and handedness
pd.crosstab(ds.Sex, ds.Handedness)

Handedness  Left  Right
Sex
Female         2      3
Male           5      2

In [17]:
# for multiiple headers
pd.crosstab(ds.Sex, [ds.Handedness, ds.Nationality])

Handedness       Left                 Right
Nationality Bangadesh China India USA China India USA
Sex
Female              1     1     0   0     1     0   2
Male                1     1     2   1     0     1   1

In [18]:
# for chi square format 
pd.crosstab(ds.Sex, ds.Handedness, margins = True)

Handedness  Left  Right  All
Sex
Female         2      3    5
Male           5      2    7
All            7      5   12

In [20]:
# now finding the percentage of female who r left handed (16.6%)
# and male who r left handed(41.6%)
pd.crosstab(ds.Sex, ds.Handedness, margins = True, normalize= True)

Handedness      Left     Right       All
Sex
Female      0.166667  0.250000  0.416667
Male        0.416667  0.166667  0.583333
All         0.583333  0.416667  1.000000

In [21]:
# now finding the "AVERAGE AGE" of the sexes(males and females)
# and handedness(left or right)
pd.crosstab(ds.Sex, ds.Handedness, values = ds.Age, aggfunc="mean")

Handedness  Left  Right
Sex
Female      44.5   31.0
Male        31.2   28.0